Terraform plan for __staging__
<details>
  <summary>Plan: 17 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_service_account_iam_member.invoice_service_account will be created
  + resource "google_service_account_iam_member" "invoice_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ebo-staging.svc.id.goog[invoice/invoice-file-upload]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "********************************************************************************************"
    }

  # kubernetes_secret.logistics_app_secret will be created
  + resource "kubernetes_secret" "logistics_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "logistics-db-secrets"
          + namespace        = "logistics-service"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.nodemaster_app_secret will be created
  + resource "kubernetes_secret" "nodemaster_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "nodemaster-db-secrets"
          + namespace        = "node-master"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.orderservice_app_secret will be created
  + resource "kubernetes_secret" "orderservice_app_secret" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "orderservice-db-secrets"
          + namespace        = "order-service"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.invoice_service_account will be created
  + resource "kubernetes_service_account" "invoice_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "invoice-file-upload@ebo-staging.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "invoice-file-upload"
          + namespace        = "invoice"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_string.logistics_user_password will be created
  + resource "random_string" "logistics_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.nodemaster_user_password will be created
  + resource "random_string" "nodemaster_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # random_string.orderservice_user_password will be created
  + resource "random_string" "orderservice_user_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "@#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["logistics"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-stg-db-c06501dd"
      + name      = "logistics"
      + project   = "ebo-staging"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["nodemaster"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-stg-db-c06501dd"
      + name      = "nodemaster"
      + project   = "ebo-staging"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_database.additional_databases["orderservice"] will be created
  + resource "google_sql_database" "additional_databases" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = "ibo-stg-db-c06501dd"
      + name      = "orderservice"
      + project   = "ebo-staging"
      + self_link = (known after apply)
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["logistics-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-stg-db-c06501dd"
      + name     = "logistics-user"
      + password = (sensitive value)
      + project  = "ebo-staging"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["nodemaster-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-stg-db-c06501dd"
      + name     = "nodemaster-user"
      + password = (sensitive value)
      + project  = "ebo-staging"
    }

  # module.inventory_google_postgres.google_sql_user.additional_users["orderservice-user"] will be created
  + resource "google_sql_user" "additional_users" {
      + host     = (known after apply)
      + id       = (known after apply)
      + instance = "ibo-stg-db-c06501dd"
      + name     = "orderservice-user"
      + password = (sensitive value)
      + project  = "ebo-staging"
    }

  # module.inventory_google_postgres.random_id.additional_passwords["logistics-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "ibo-stg-db-c06501dd"
        }
    }

  # module.inventory_google_postgres.random_id.additional_passwords["nodemaster-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "ibo-stg-db-c06501dd"
        }
    }

  # module.inventory_google_postgres.random_id.additional_passwords["orderservice-user"] will be created
  + resource "random_id" "additional_passwords" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "name" = "ibo-stg-db-c06501dd"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #234](https://github.com/ebomart/commerce-infrastructure/actions/runs/1310889285)